String license = """
【重要提示】
请您在开始使用闻上盒子系列产品（以下简称“本产品”）之前请务必仔细阅读并理解《用户许可使用协议》（以下简称“本协议”）中规定的所有权利和限制。

上海闻上信息科技有限公司及关联公司（以下简称“闻上”或“我们”）一向尊重并会严格保护用户在使用本产品时的合法权益（包括用户隐私、用户数据等）不受到任何侵犯。

本产品包括但不限于闻上盒子硬件与闻上盒子相关软件（包括闻上盒子软件操作系统和名为“闻上盒子”的移动设备端软件应用、PC电脑端软件应用和Mac电脑端软件应用以及闻上盒子云服务等产品）及其相关的、均由闻上开发的产品。本产品中相关的知识产权（包括本产品的一切版权、专利权、商标权等）均属于闻上。

本协议（包括本文最后部分的隐私政策）是用户（包括通过各种合法途径获取到本产品的自然人、法人或其他组织机构，以下简称“用户”或“您“）与闻上之间针对本产品相关事项最终的、完整的且排他的协议，并取代、合并之前的当事人之间关于上述事项的讨论和协议。

本协议将对用户使用本产品的行为产生法律约束力，您已承诺和保证有权利和能力订立本协议。用户开始使用本产品将视为已经接受本协议，请认真阅读并理解本协议中各条款，包括免除和限制闻上责任的免责条款和对用户的权利限制（未成年人审阅时应由法定监护人陪同），如果您不能接受本协议中的全部条款，请勿开始使用本产品。

1、使用
1.1 帐户

您必须承诺对您的登录信息保密、不被其他人获取与使用，并且对您在本网站账户下的所有行为负责。您必须将任何有可能触犯法律的、未授权使用或怀疑为未授权使用的行为在第一时间通知本产品。本产品不对您因未能遵守上述要求而造成的损失承担法律责任。
1.2 网络加速与故障检测服务
在您使用本产品的过程中，有部分使用场景本产品会在征询您的同意之后对您在使用过程中的一部分网络访问行为进行检测。此举旨在帮助您进行网络加速与并在必要的时候执行故障检测服务。该检测全部由软件程序完成，不会有任何人为监控，只是使用相关的软件程序进行匹配并指引您打开相应的第三方内容或页面。我们承诺将确保您在使用本产品过程中的隐私不会被泄露。

2、终端用户协议
2.1 许可
依据本协议规定，本产品将授予您以下不可转让的、非排他的许可：
2.1.1 使用本产品的权利；
2.1.2 在您所有的网络通信设备、计算机设备和移动通信设备上下载、安装、使用本产品的权利。
2.2 限制性条款
本协议对您的授权将受到以下限制：
2.2.1 您不得对本产品进行任何形式的许可、出售、租赁、转让、发行或其他商业用途；
2.2.2 除非法律禁止此类限制，否则您不得对本产品的任何部分或衍生产品进行修改、翻译、改编、合并、利用、分解、改造或反向编译、反向工程等；
2.2.3 您不得以创建相同或竞争服务为目的使用本产品；
2.2.4 除非法律明文规定，否则您不得对本产品的任何部分以任何形式或方法进行生产、复制、发行、出售、下载或显示等；
2.2.5 您不得删除或破坏包含在本产品中的任何版权声明或其他所有权标记。
2.3 权利归属
2.3.1 闻上许可您使用、下载本产品；
2.3.2 闻上（及其“授权人”，如有）拥有本产品的所有相关知识产权。

2.4 费用
您必须自行负担购买本产品的费用，个人上网或第三方（包括但不限于电信或移动通讯提供商）收取的通讯费、信息费等相关费用。如涉及电信增值服务，我们建议您与增值服务提供商确认相关费用问题。
2.5 任何本产品的更新版本或未来版本、更新或者其他变更将受到本协议约束。

3、用户内容
3.1 用户内容
3.1.1 用户内容是指该用户下载、发布或以其他方式使用本产品时产生的所有内容（例如：您的信息、图片、音乐或其他内容）。
3.1.2 您是您的用户内容唯一的责任人，您将承担因您的用户内容披露而导致的您或任何第三方被识别的风险。
3.1.3 您已同意您的用户内容受到第4条的限制。
3.1.4本产品需要搭配硬盘使用，闻上对于您的非正常使用情况（如对硬盘的拆卸、分解或将硬盘使用在其他非闻上产品上）所可能带来的内容损坏、丢失等情况将不负责。

3.2 反馈
3.2.1 您对闻上提出的建议（或称“反馈”），即视为您向闻上转让“反馈”的全部权利并同意闻上有权利以任何合理方式使用此反馈及其相关信息。我们将视此类反馈信息为非保密且非专有；
3.2.2 您已同意您不会向闻上提供任何您视为保密和专有的信息。
3.3 我们将保留基于我们的判断检查用户分享内容的权利（而非义务）。

4、权利限制
4.1 您已同意通过分享或其他方式使用本产品中的相关服务，在使用过程中，您将承担因下述行为所造成的风险而产生的全部法律责任：
4.1.1 破坏宪法所确定的基本原则的；
4.1.2 危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；
4.1.3 损害国家荣誉和利益的；
4.1.4 煽动民族仇恨、民族歧视，破坏民族团结的；
4.1.5 破坏国家宗教政策，宣扬邪教和封建迷信的；
4.1.6 散布谣言，扰乱社会秩序，破坏社会稳定的；
4.1.7 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
4.1.8 侮辱或者诽谤他人，侵害他人合法权益的；
4.1.9 含有法律、行政法规禁止的其他内容的。
4.2 您已同意不在本产品从事下列行为：
4.2.1 发布或分享电脑病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；
4.2.2 未授权的情况下，收集其他用户的信息或数据，例如电子邮箱地址等；
4.2.3 用自动化的方式恶意使用本产品，给服务器造成过度的负担或以其他方式干扰或损害网站服务器和网络链接；
4.2.4 在未授权的情况下，尝试访问本产品的服务器数据或通信数据；
4.2.5 干扰、破坏本产品其他用户的使用。

5、修改和终止
5.1 修改
5.1.1 本协议容许变更。如果本协议有任何实质性变更，我们将通过电子邮件或本产品官方网站（http://www.wisnuc.com ）的公告来通知您。变更通知之后，继续使用本产品则视为您已知晓此类变更并同意接受条款约束。
5.1.2 闻上保留在任何时候无需通知而修改、保留或关闭本产品任何服务之权利。
5.1.3 您已同意闻上无需因修改、保留或关闭本产品任何服务的行为对您或第三方承担责任。
5.2 终止
5.2.1 本协议自您接受之日起生效，在您使用本产品的过程中持续有效，直至依据本协议终止；
5.2.2 尽管有上述规定，如果您使用本产品的时间早于您接受本协议的时间，您在此知晓并同意本协议于您第一次使用本产品时生效，除非依据本协议提前终止；
5.2.3 我们可能会依据法律的规定，保留您使用本产品或者本网站账户的权利；无论是否通知，我们将在任何时间以任何原因终止本协议，包括出于善意的相信您违反了我们可接受使用政策或本协议的其他规定；
5.2.4 不受前款规定所限，如果用户侵犯第三人的版权且闻上接到版权所有人或版权所有人的合法代理人的通知后，闻上保留终止本协议的权利；
5.2.5 一旦本协议终止，您使用本产品的权利即告终止。您应当知晓您的产品终止意味着您的用户内容将从我们的活动数据库中删除。闻上不因终止本协议对您承担任何责任，包括终止您的用户账户和删除您的用户内容。


6、第三方
6.1 您已知晓或同意我们的部分服务是基于第三方的技术支持获得。
您已知晓本协议是在您与闻上之间签订，而非您与上述第三方之间签订。闻上是基于本产品所产生的内容、维护、支持服务、保证和由此产生的诉讼等事项的唯一责任人。您已同意遵守且授权给本产品限制您有条件地使用本产品的服务。
6.2 第三方信息和服务
6.2.1 本产品包含了第三方的部分信息和服务。闻上不控制且不对第三方的信息和服务负责。
6.2.2 闻上仅为您使用方便之目的或为承诺和保证第三方之需要而提供此类信息和服务。
6.2.3 用户需对使用第三方信息和服务产生的风险承担法律责任。
6.2.4 当用户访问第三方信息和服务时，适用第三方的条款和政策。
6.3 其他用户
6.3.1 本产品包含其他用户提供的用户内容。本产品不控制且不对用户内容承担法律责任。本产品没有检查、监控、审批、核准、承诺并保证用户内容的义务。您必须因使用用户内容和与其他用户互动产生的风险承担法律责任。
6.3.2 用户与其他用户的互动仅属于您与其他用户之间的行为，本产品对此类行为不承担任何法律责任。您已同意本产品对此类互动行为的结果不承担法律责任。

7、赔偿
7.1 您已同意无害地使用本产品，避免闻上因下述行为或相关行为遭受来自第三方的任何投诉、诉讼、损失、损害、责任、成本和费用（包括律师费）：
7.1.1 用户使用本产品的行为；
7.1.2 用户的用户内容；
7.1.3 用户违反本协议的行为。
7.2 闻上保留专属抗辩权和请求赔偿的权利。
7.3 您已同意，除非获得闻上书面同意，您不得在您与闻上共同对第三方提起的诉讼中单方和解。
7.4 闻上将尽合理努力将此类诉讼、诉讼行为或进程通知您。
7.5 在任何情况下，本产品都不对您或任何第三方因本协议产生的任何间接性、后果性、惩戒性的、偶然的、特殊或惩罚性的损害赔偿承担责任。访问、使用本产品所产生的损坏计算机系统或移动通讯设备数据库的风险将由您个人承担。

8、免责声明
8.1 如发生下述情形，本产品不承担任何法律责任：
8.1.1 依据法律规定或相关政府部门的要求提供您的个人信息；
8.1.2 由于您的使用不当而导致任何个人信息的泄露；
8.1.3 任何由于黑客攻击，电脑病毒侵入，非法内容信息，骚扰信息的屏蔽，政府管制以及其他任何网络、技术、通信线路、信息安全管理措施等原因造成的服务中断、受阻等不能满足用户要求的情形；
8.1.4 用户因第三方如运营商的通讯线路故障、技术问题、网络、电脑故障、系统不稳定及其他因不可抗力造成的损失的情形；
8.1.5 使用本产品可能存在的来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息而招致的风险；
8.1.6 本产品明文声明，不以明示或默示及以任何形式对本产品及其合作公司服务之及时性、安全性、准确性做出担保。

9、隐私政策
9.1 “闻上盒子系列产品隐私政策”为本协议的一部分，您可以在本文的最后部分找到。请您认真阅读并理解隐私协议中的所有内容。
9.2 您在使用本产品的更多功能或闻上其他相关服务时，我们可能向您收集更多的个人信息，或为了向您提供更好的服务而以新的目的使用或披露您的个人信息， 我们将严格遵守闻上隐私政策惯例管理您的个人信息，我们的隐私政策惯例公告在闻上旗下网站（http://www.wisnuc.com ），请认真阅读并理解闻上隐私政策惯例。
9.3 如果我们对隐私政策进行重大变更，我们将在闻上网站公布，这样您可以了解我们收集的信息以及我们如何使用这些信息。此类隐私政策变化将从通知或网站规定的生效日期开始适用。您继续使用产品和网站、手机和/或其他任何设备上的服务，将被视为接受更新的隐私政策。请您定期查阅闻上网站获取我们隐私权实践的最新信息。您继续使用本产品或其他任何相关服务，将被视为接受更新的隐私政策。



10、适用法律
10.1 本协议适用中华人民共和国法律。
10.2 如果双方发生纠纷，应本着友好的原则协商解决；如协商不成，应向闻上所在地的法院提起诉讼。

11、独立性
本协议中的某些条款因故无法适用，则本协议的其他条款继续适用且无法适用的条款将会被修改，以便其能够依法适用。

12、完整性
12.1 本协议（包括隐私政策）是您和本产品之间关于本产品相关事项的最终的、完整的、排他的协议，且取代和合并之前当事人关于此类事项（包括之前的最终用户许可、服务条款和隐私政策）的讨论和协议。 
12.2 每部分的题目只为阅读之便而无任何法律或合同义务。
12.3 除非闻上书面同意，您不得转让本协议所规定的权利义务。任何违反上述规定企图转让的行为均无效。
""";
